Tutorials/RNGkEpsilon/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
 (  0 -0.4 0 ) //0
 ( 3.787385423173188  -0.4 0 ) //1
 (  0 -0.3 0 ) //2
 ( 3.787385423173188  -0.3 0 ) //3
 (  0  0.4 0 ) //4
 ( 3.787385423173188   0.4 0 ) //5
                 
 (  0 -0.4 0.1 ) //6
 ( 3.787385423173188  -0.4 0.1 ) //7
 (  0 -0.3 0.1 ) //8
 ( 3.787385423173188  -0.3 0.1 ) // 9 
 (  0  0.4 0.1 ) // 10
 ( 3.787385423173188   0.4 0.1 ) //11                   
);

blocks          
(
    hex (0 1 3 2 6 7 9 8) ( 379 10 1 ) simpleGrading (1 1 1)
    hex (2 3 5 4 8 9 11 10) ( 379 70 1 ) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
  cyclic inlet
    (
        (0 6 8 2)
	(2 8 10 4)
	(1 3 9 7)
	(3 5 11 9)
    )
    wall bottom 
    (
        (0 1 7 6)
    )
 /*
 patch outlet
 //cyclic outlet
    (
        (1 5 7 3)
    )
 */
    patch atmosphere 
    (
        (4 10 11 5)
    )
    
    empty frontBack
    (
        (0 2 3 1)
        (2 4 5 3)
    (6 7 9 8)
        (8 9 11 10)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
